Revit 2027 API
Floor.FloorType Property
 Retrieves/sets an object that represents the type of the floor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FloorType FloorType { get; set; }
Public Property FloorType As FloorType
	Get
	Set
public:
property FloorType^ FloorType {
	FloorType^ get ();
	void set (FloorType^ value);
}
member FloorType : FloorType with get, set
Property Value
FloorType
Exceptions
Exception | Condition
ArgumentException |  When setting this property: Floor type is not valid for this floor.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The floor type can be used to access the multi layered structure of a floor.
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace